[JetBoosters_MK0 X2EquipmentTemplate]
FriendlyName="Jump Jets"
FriendlyNamePlural="Jump Jets"
BriefSummary="Employs scavenged Celatid antigrav systems to allow soldiers to jump up to higher elevations without the need of a ladder or even a wall to climb."
TacticalText="<Bullet/> We may be able to fabricate versions with more advanced capabilities if we can salvage more powerful boosters from something else, like a robot or another alien."

[JetBoosters_MK0_Tech X2TechTemplate]
DisplayName="Jump Jets"
Summary="We may be able to use a Celatid's antigrav systems as a starting point to improve the upward mobility of our soldiers. A little bit of alloy shielding will be necessary to protect the soldier from exhaust heat." 